{"id":13104,"date":"2021-01-20T00:51:15","date_gmt":"2021-01-20T05:51:15","guid":{"rendered":"https:\/\/www.unifiedinfotech.net\/blog\/?p=13104"},"modified":"2021-08-10T08:17:40","modified_gmt":"2021-08-10T12:17:40","slug":"remote-design-sprint-guide","status":"publish","type":"post","link":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/","title":{"rendered":"Remote Design Sprints 101: How We Do It The Unified Way"},"content":{"rendered":"<p style=\"text-align: left;\">There was a time, ages ago, when things were normal. People went to work, and work-from-home was almost unheard of. No one knew such a thing called social distancing existed. In January of 2020, our design team found itself at a crossroads as to what to do.<\/p>\n<p style=\"text-align: left;\">In short, we were feeling stuck. Our team had been making major strides in terms of design work, but we felt we needed a little more vision. Something that would fire us up to the Design Hall of Fame. We were aiming for the stars.<\/p>\n<p style=\"text-align: left;\">After hours of thinking and overthinking (yes, we creatives keep doing that), we decided that a design sprint was the answer. Or was it? That’s what we thought, at least. We had lovely visions for our future. Collaborative creative teams working on a product together. Aah, art!<\/p>\n<p style=\"text-align: left;\">But as our design head began to plan out various stages of the design sprint process, an impending disaster started to loom in our world.  A strain of the novel Coronavirus had made it to the US, rapidly spreading across different continents.<\/p>\n<p style=\"text-align: left;\">In a couple of months, we learned that the entire world was going on lockdown. Social distancing and quarantine were strict norms we’d have to abide by. At Unified, as with many other organizations worldwide, the need for remote work was instantly felt. Work from home was now the ‘new normal.’<\/p>\n<p style=\"text-align: left;\">So as creatives, what were we supposed to do? Call it quits? That wasn’t an option. How would we brainstorm for hours on whiteboards? Was it possible to carry out remote design sprints? As it’s now clear, it was.<\/p>\n<p style=\"text-align: left;\">Here’s how we did it.<\/p>\n<h2 id=\"id_1\" style=\"text-align: left;\">1. What Is A Design Sprint?<\/h2>\n<p style=\"text-align: left;\">But first, a brief introduction for those who are new to the design world.<\/p>\n<p style=\"text-align: left;\">Made famous by <a href=\"https:\/\/www.gv.com\/sprint\/\">Google Ventures<\/a>, design sprint activities have been fairly popular in the industry for quite some time now. Basically, a design sprint is a simple framework that helps translate abstract design ideas into testable, real products.<\/p>\n<p style=\"text-align: left;\">As the name suggests, a sprint focuses more on speed and efficiency than perfection. Plus, it’s much more collaborative in nature.<\/p>\n<p style=\"text-align: left;\">Sounds complicated? We’ll make it easier for you. What you do is put a group of talented designers, developers, and product managers in one room. You tell them to finish the design and only then, come out outside. We’re serious.<\/p>\n<p style=\"text-align: left;\">The conventional design sprint somewhat resembles a double-diamond structure. Every stage corresponds to each day of the design process.<\/p>\n<h3 style=\"text-align: left;\">These stages are, namely: Mapping, Sketching, Defining, Prototyping, and finally, Testing. Here’s what it looks like:<\/h3>\n<figure id=\"attachment_13105\" aria-describedby=\"caption-attachment-13105\" style=\"width: 2134px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-13105 size-full\" src=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01.jpg\" alt=\"Remote Design Sprints\" width=\"2134\" height=\"1663\" srcset=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01.jpg 2134w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01-300x234.jpg 300w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01-1024x798.jpg 1024w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01-768x598.jpg 768w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01-1536x1197.jpg 1536w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/1-01-2048x1596.jpg 2048w\" sizes=\"(max-width: 2134px) 100vw, 2134px\" \/><figcaption id=\"caption-attachment-13105\" class=\"wp-caption-text\">Source: abstract.com<\/figcaption><\/figure>\n<p style=\"text-align: left;\">To sum it up: a design sprint is a five-day process that gives you, the design lead, ample time to answer some of the most pressing questions. What will be your design and branding strategy? How are you going to test your model?<\/p>\n<p style=\"text-align: left;\">Design sprints are like the “Top 50 Hits” of your business and web design strategy. Whether it’s design thinking, customer psychology, or innovation, you can just bottle all these up in a concise plan for your team to use.<\/p>\n<div class=\"related-post-box\" style=\"text-align: left;\">\n<div class=\"related-post-box-item\">\n<p class=\"title\">Related Read: Learn more about our <a href=\"https:\/\/www.unifiedinfotech.net\/blog\/branding-and-website-design\/\">5-step branding process and design strategy here<\/a>. It just goes on to show how reliable we are as a brand design company. And we’re not gloating!<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: left;\">Instead of waiting for your first prototype to launch and figure out if it’s any good, you can use design sprints as your short cut route to launching and prototyping.<\/p>\n<p style=\"text-align: left;\">If you ask us, design sprint planning is a superpower that few have.  It’s a lot like a time-machine: you can just fling yourself into the future and see what your design ultimately looks like. Besides, you can gauge how your customers will feel about it before making errors that are too expensive.<\/p>\n<p style=\"text-align: left;\">And, and, and, you can also avoid this:<\/p>\n<figure id=\"attachment_13106\" aria-describedby=\"caption-attachment-13106\" style=\"width: 600px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-13106 size-full\" src=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/design-sprint-meme.png\" alt=\"Remote Design Sprints meme\" width=\"600\" height=\"600\" srcset=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/design-sprint-meme.png 600w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/design-sprint-meme-300x300.png 300w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/design-sprint-meme-150x150.png 150w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><figcaption id=\"caption-attachment-13106\" class=\"wp-caption-text\">Source: https:\/\/bit.ly\/35hZdTC<\/figcaption><\/figure>\n<h2 id=\"id_2\" style=\"text-align: left;\">2. Warming Up: Running Remote Design Sprints<\/h2>\n<p style=\"text-align: left;\">Design sprints are the stuff of legend. We mean, just look at <a href=\"https:\/\/slack.com\/intl\/en-in\/\">Slack<\/a>. Or <a href=\"https:\/\/medium.com\/\">Medium<\/a>. Or <a href=\"https:\/\/nest.com\/\">Nest<\/a>. Pretty much every tech giant in the world has signed up with Google’s design sprints venture or some other <a href=\"https:\/\/www.unifiedinfotech.net\/\">web design company<\/a>. It’s helped them enter untapped markets, gain millions of customers, and ultimately transform marketing as we knew it.<\/p>\n<p style=\"text-align: left;\">So here’s what you need to do before you run your remote design sprint:<\/p>\n<h3 style=\"text-align: left;\">a. Read THAT Remote Design Sprints  Book<\/h3>\n<p style=\"text-align: left;\">If you’re a web designer, you’ve probably heard of Jake Knapp, Google’s former Design Lead. And that book he wrote. The book that changed how we worked in design. It’s called <a href=\"https:\/\/g.co\/kgs\/xdxjA7\">Sprint (How to Solve Big Problems and Test New Ideas in Just Five Days)<\/a>. If you’ve never been part of a design sprint before, you need to read this book. Like, really read it.<\/p>\n<p style=\"text-align: left;\">And please don’t skim read. Read every part of the book. Love it, smell the pages (no, we’re kidding). But it helps if you give it a thorough run through and make notes to yourself. The book includes some excellent design sprint challenges that’ll help you nurture your creativity.<\/p>\n<p style=\"text-align: left;\">Before you ready yourself for the big day, it’s imperative that you take a close, hard look at all the activities and refresh your ideas. In most likelihood, you’ll have a lot to balance, so reading the book will help clear the ground.<\/p>\n<h3 style=\"text-align: left;\">b. Devise A Plan<\/h3>\n<p style=\"text-align: left;\">Every project that was successfully executed had some great planning to back it. Before you run your design sprint remotely, just fixate on some essential tools, you’ll need. Here are some tools that we suggest you use.<\/p>\n<ul style=\"text-align: left;\">\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.figma.com\/\">Figma<\/a> for design storyboarding, wireframing, and finally, prototyping<\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.mural.co\/\">Mural <\/a>for chalking out your ideas on a virtual whiteboard<\/li>\n<li style=\"font-weight: 400;\">Slack for all kinds of asynchronous communication and messaging<\/li>\n<li style=\"font-weight: 400;\">Google Meet, Zoom, or Microsoft Teams for real-time video conferencing, communication, and meetings<\/li>\n<\/ul>\n<p style=\"text-align: left;\">Besides these, there are many other options that your team might prefer. Whatever they are, make sure to list them neatly in your calendar or schedule. Also, add meeting codes to any digital space you might use.<\/p>\n<div class=\"related-post-box\" style=\"text-align: left;\">\n<div class=\"related-post-box-item\">\n<p class=\"title\">Pro Tip: Set the same access code everywhere. You don’t want twenty people calling you up every other second begging for the code.<\/p>\n<\/div>\n<\/div>\n<h3 style=\"text-align: left;\">b. Preparing Your Design Sprint Tools<\/h3>\n<p style=\"text-align: left;\">Secretly, we kind of thanked COVID-19 for all that work-from-home. No more Post-its, flyers, easel pads, new markers to worry about.<\/p>\n<p style=\"text-align: left;\">It’s gotten so much easier now with virtual whiteboards like Mural or, if you’re feeling adventurous, artboards in Figma. Besides these, there are several other offerings that you can use as your canvas, such as <a href=\"https:\/\/www.adobe.com\/in\/products\/xd.html\">Adobe XD<\/a>, <a href=\"https:\/\/www.sketch.com\/\">Sketch<\/a>, or Adobe Photoshop.<\/p>\n<p style=\"text-align: left;\">Sure, you’re going to miss the smell of fresh marker ink or stickers clinging to every part of your workspace, but that’s a small price to pay for freedom, really.<\/p>\n<p style=\"text-align: left;\">Post-COVID, several brands launched remote design sprint kits, but you can keep it simple with the tools you already know.<\/p>\n<p style=\"text-align: left;\">Just make sure you remind them to buy pens and paper in advance. In case they need it for sketching out their design solutions on something tangible.<\/p>\n<h3 style=\"text-align: left;\">c. A Nice Cozy Workplace for Remote Design Sprints<\/h3>\n<p style=\"text-align: left;\">This one’s kind of a dream. As designers and creatives, we all want our work desks to look absolutely Instagrammable. Cozy nooks, natural light, planters, and the perfect cup of French-pressed coffee. But no, that’s not going to be the case with remote design sprints.<\/p>\n<p style=\"text-align: left;\">Virtual whiteboard, schedules, sketches, phew&#8230;all this is going to make it impossible for you to have that super gorgeous work desk. But you can always go back to it once your design sprint’s over. Can’t you?<\/p>\n<h2 id=\"id_3\" style=\"text-align: left;\">3. Going Into The Battlefield<\/h2>\n<p style=\"text-align: left;\">Until the COVID pandemic struck, the general consensus was that design sprints are best conducted offline. That’s because these are incredibly energy-consuming processes. It’s highly collaborative in nature, and back when things were normal, the sheer busyness would overwhelm us.<\/p>\n<p style=\"text-align: left;\">People rushing around, chasing Post-Its, sketching ideas in a frenzy. You get the picture. Trying to shift it online would then mean complete and utter chaos. Well, we don’t think so.<\/p>\n<p style=\"text-align: left;\">The most significant factor that determines how successful your remote design sprint is time. When it came to offline sprints, time was in abundance. You could take four to five days and work at your pace. Remote design sprints: that’s a whole different world. We suggest two to three days at max.<\/p>\n<p style=\"text-align: left;\">To give yourself enough time to think, make sure to conduct all your research before running the sprint. If you’re the project lead, ensure everyone does their bit of research. Things like <a href=\"https:\/\/www.unifiedinfotech.net\/blog\/user-experience-design-and-usability\/\">usability<\/a>, user experience, and customer challenges should be of prime importance.<\/p>\n<div class=\"related-post-box\" style=\"text-align: left;\">\n<div class=\"related-post-box-item\">\n<p class=\"title\">Also Read: Take a look at <a href=\"https:\/\/www.unifiedinfotech.net\/blog\/digital-transformation-for-ecommerce-client\/\">how we revamped our client’s eCommerce website<\/a> with stunning design thinking.<\/p>\n<\/div>\n<\/div>\n<h3 style=\"text-align: left;\">a. Day 1: Mapping and Sketching<\/h3>\n<p style=\"text-align: left;\">As Jake Knapp famously said in his book, “The structure allows the team to “boot up” as much information as quickly as possible — while preventing the usual meandering conversations.” The idea of a design sprint in itself is very efficient, and once you get down to work, you can come up with ideas quickly.<\/p>\n<p style=\"text-align: left;\">Launching your design team into the Mapping phase on the very first day is a great idea. Take a look at all the things that you need to do, such as:<\/p>\n<p style=\"text-align: left;\">i. Asking Your Design Experts<\/p>\n<p style=\"text-align: left;\">ii. Work To Be Done<\/p>\n<p style=\"text-align: left;\">iii. Grouping Affinities<\/p>\n<p style=\"text-align: left;\">iv. Execution<\/p>\n<p style=\"text-align: left;\">By the end of the day, you’re going to have some great ideas, ready to be sketched. Dive into the sketching exercises and make it a truly collaborative team effort. To translate your sketches into reality, you can use an iPad or even Miro’s remote design sprint templates. If you don’t prefer Miro, you can always switch to a <a href=\"https:\/\/design-sprint.com\/remote-design-sprint-template\/\">Google design sprint template<\/a>.<\/p>\n<p style=\"text-align: left;\">When it’s finally time to call it a day, you’ll have tons of creative design ideas waiting to be full-fledged product solutions.<\/p>\n<h3 style=\"text-align: left;\">b. Day 2: Defining And Deciding<\/h3>\n<p style=\"text-align: left;\">Not every idea is going to make it to the testing phase. Testing and launching are extremely time and money-consuming processes, so you’ll have to fixate on any one.<\/p>\n<p style=\"text-align: left;\">Here’s what we suggest you can do: divide your team into smaller groups and decide on your options. Vote on the ones that seem most promising. Debate and define what you want from your design, and then finally, you can zero in on one.<\/p>\n<p style=\"text-align: left;\">When you have your winning design in hand, you can create a step-by-step storyboard. Sketch out how users are going to interact with your product. Whether it’s <a href=\"https:\/\/www.unifiedinfotech.net\/services\/website-design\/\">web design<\/a> for <a href=\"https:\/\/www.unifiedinfotech.net\/services\/mobile-app-development\/\">mobile apps<\/a>, <a href=\"https:\/\/www.unifiedinfotech.net\/services\/ui-ux-design\/\">UI\/UX design<\/a> for an <a href=\"https:\/\/www.unifiedinfotech.net\/services\/ecommerce-website-development\/\">eCommerce website<\/a>, outlining a skeleton will go a long way.<\/p>\n<p style=\"text-align: left;\">You’re now at the end of your remote design sprint—time to follow up with prototypes and testing.<\/p>\n<h2 id=\"id_4\" style=\"text-align: left;\">4. The Afterparty in Remote Design Sprints<\/h2>\n<p style=\"text-align: left;\">So your remote design sprint’s over. Congrats! You made it! Now go thank your colleagues and teammates for the amazing work they’ve done. Collaboration, as they say, is the key to all great creative work.<\/p>\n<p style=\"text-align: left;\"><img loading=\"lazy\" class=\"aligncenter wp-image-13117 size-large\" src=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-rfstudio-3810754-1024x731.jpg\" alt=\"Remote Design Sprints afterparty\" width=\"1024\" height=\"731\" srcset=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-rfstudio-3810754-1024x731.jpg 1024w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-rfstudio-3810754-300x214.jpg 300w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-rfstudio-3810754-768x548.jpg 768w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-rfstudio-3810754.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p style=\"text-align: left;\">But you’re not done with things yet. After the end of your two to three-day remote sprint work, it’s time for some design sprint user testing. Once your design team rushes off to turn the storyboard into reality and a workable prototype, you’ll have to launch user testing sessions.<\/p>\n<p style=\"text-align: left;\">This is the part where you expose real-world users to your prototypes and see how your design fares. There are chances it could turn out to be a complete failure but keep your fingers crossed.<\/p>\n<h2 id=\"id_5\" style=\"text-align: left;\">5. Weaving Magic<\/h2>\n<p style=\"text-align: left;\">There was a time when if you told someone you were about to run a remote design sprint, they’d have scoffed at you.  Not anymore. Digital sprints are here to stay. They are not just workable, but very useful too.<\/p>\n<p style=\"text-align: left;\"><img loading=\"lazy\" class=\"aligncenter wp-image-13116 size-large\" src=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-startup-stock-photos-212286-1024x682.jpg\" alt=\"Remote Design Sprints magic\" width=\"1024\" height=\"682\" srcset=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-startup-stock-photos-212286-1024x682.jpg 1024w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-startup-stock-photos-212286-300x200.jpg 300w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-startup-stock-photos-212286-768x512.jpg 768w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/pexels-startup-stock-photos-212286.jpg 1280w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p style=\"text-align: left;\">If your design sprint turns out to be successful, well, good for you. Whatever the outcome, a little retrospection is going to do you a lot of good.<\/p>\n<p style=\"text-align: left;\">What was most valuable? Which part of the process did you most like? Is there a different approach you can take? How is the customer experience going to turn out like? These are some questions that you can ask yourself.<\/p>\n<div class=\"related-post-box\" style=\"text-align: left;\">\n<div class=\"related-post-box-item\">\n<p class=\"title\">Read Also: Learn more about <a href=\"https:\/\/www.unifiedinfotech.net\/blog\/customer-experience-design-secrets\/\">why enhancing customer experience in web design is the new ‘normal<\/a>.’<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: left;\">At Unified, we’ve run successful design sprints every now and then. We asked one of our users, and this is what they said:<\/p>\n<h3 style=\"text-align: left;\">“Oh my god, this is the most amazing thing I’ve ever seen! I can’t even…”<\/h3>\n<p style=\"text-align: left;\">We swear it’s the absolute truth.<\/p>\n<p style=\"text-align: left;\">Looking for a great product design and development company for your ideas? Why not get in touch with us?<\/p>\n<p><a href=\"https:\/\/www.unifiedinfotech.net\/about\/contact\/\"><img loading=\"lazy\" class=\"wp-image-13120 size-large alignleft\" src=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5-1024x745.jpg\" alt=\"\" width=\"1024\" height=\"745\" srcset=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5-1024x745.jpg 1024w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5-300x218.jpg 300w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5-768x559.jpg 768w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5-1536x1117.jpg 1536w, https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/cta_image5.jpg 1650w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There was a time, ages ago, when things were normal. People went to work, and work-from-home was almost unheard of. No one knew such a thing called social distancing existed. In January of 2020, our design team found itself at a crossroads as to what to do. In short, we were feeling stuck. Our team [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":13114,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[14,23,269,27],"tags":[345,344,34],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.6.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style<\/title>\n<meta name=\"description\" content=\"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style\" \/>\n<meta property=\"og:description\" content=\"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"Unified Infotech\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/unifiedinfotech\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-20T05:51:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-10T12:17:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/sprint-design1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1650\" \/>\n\t<meta property=\"og:image:height\" content=\"860\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Pratip Biswas\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@unified_infotec\" \/>\n<meta name=\"twitter:site\" content=\"@unified_infotec\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pratip Biswas\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\"},\"author\":{\"name\":\"Pratip Biswas\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428\"},\"headline\":\"Remote Design Sprints 101: How We Do It The Unified Way\",\"datePublished\":\"2021-01-20T05:51:15+00:00\",\"dateModified\":\"2021-08-10T12:17:40+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\"},\"wordCount\":2177,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\"},\"keywords\":[\"application design\",\"remote design sprints\",\"web design\"],\"articleSection\":[\"All\",\"Client Guides\",\"Design &amp; Development\",\"Tech\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\",\"name\":\"Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style\",\"isPartOf\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#website\"},\"datePublished\":\"2021-01-20T05:51:15+00:00\",\"dateModified\":\"2021-08-10T12:17:40+00:00\",\"description\":\"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.unifiedinfotech.net\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Remote Design Sprints 101: How We Do It The Unified Way\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#website\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/\",\"name\":\"Unified Infotech\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.unifiedinfotech.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\",\"name\":\"Unified Infotech\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/\",\"sameAs\":[\"https:\/\/www.instagram.com\/unified.infotech\/\",\"https:\/\/www.linkedin.com\/company\/unifiedinfotech\/\",\"https:\/\/www.facebook.com\/unifiedinfotech\/\",\"https:\/\/twitter.com\/unified_infotec\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg\",\"contentUrl\":\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg\",\"width\":300,\"height\":300,\"caption\":\"Unified Infotech\"},\"image\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428\",\"name\":\"Pratip Biswas\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g\",\"caption\":\"Pratip Biswas\"},\"description\":\"I am an Entrepreneur and a Tech Geek with more than 1500 successful projects launched. I share my experience through my love for writing and help other entrepreneurs reach their business goals.\",\"sameAs\":[\"https:\/\/www.unifiedinfotech.net\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style","description":"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/","og_locale":"en_US","og_type":"article","og_title":"Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style","og_description":"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.","og_url":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/","og_site_name":"Unified Infotech","article_publisher":"https:\/\/www.facebook.com\/unifiedinfotech\/","article_published_time":"2021-01-20T05:51:15+00:00","article_modified_time":"2021-08-10T12:17:40+00:00","og_image":[{"width":1650,"height":860,"url":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2021\/01\/sprint-design1.jpg","type":"image\/jpeg"}],"author":"Pratip Biswas","twitter_card":"summary_large_image","twitter_creator":"@unified_infotec","twitter_site":"@unified_infotec","twitter_misc":{"Written by":"Pratip Biswas","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#article","isPartOf":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/"},"author":{"name":"Pratip Biswas","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428"},"headline":"Remote Design Sprints 101: How We Do It The Unified Way","datePublished":"2021-01-20T05:51:15+00:00","dateModified":"2021-08-10T12:17:40+00:00","mainEntityOfPage":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/"},"wordCount":2177,"commentCount":0,"publisher":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization"},"keywords":["application design","remote design sprints","web design"],"articleSection":["All","Client Guides","Design &amp; Development","Tech"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/","url":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/","name":"Our Detailed Guide To Doing Remote Design Sprints SCS INFO Style","isPartOf":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#website"},"datePublished":"2021-01-20T05:51:15+00:00","dateModified":"2021-08-10T12:17:40+00:00","description":"In the new reality of work-from-home, remote design sprints are fast catching on as a viable collaboration technique. Here’s how you can do yours.","breadcrumb":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.unifiedinfotech.net\/blog\/remote-design-sprint-guide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.unifiedinfotech.net\/blog\/"},{"@type":"ListItem","position":2,"name":"Remote Design Sprints 101: How We Do It The Unified Way"}]},{"@type":"WebSite","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#website","url":"https:\/\/www.unifiedinfotech.net\/blog\/","name":"Unified Infotech","description":"","publisher":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.unifiedinfotech.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization","name":"Unified Infotech","url":"https:\/\/www.unifiedinfotech.net\/blog\/","sameAs":["https:\/\/www.instagram.com\/unified.infotech\/","https:\/\/www.linkedin.com\/company\/unifiedinfotech\/","https:\/\/www.facebook.com\/unifiedinfotech\/","https:\/\/twitter.com\/unified_infotec"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg","contentUrl":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg","width":300,"height":300,"caption":"Unified Infotech"},"image":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428","name":"Pratip Biswas","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g","caption":"Pratip Biswas"},"description":"I am an Entrepreneur and a Tech Geek with more than 1500 successful projects launched. I share my experience through my love for writing and help other entrepreneurs reach their business goals.","sameAs":["https:\/\/www.unifiedinfotech.net\/"]}]}},"_links":{"self":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/13104"}],"collection":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/comments?post=13104"}],"version-history":[{"count":10,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/13104\/revisions"}],"predecessor-version":[{"id":13370,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/13104\/revisions\/13370"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/media\/13114"}],"wp:attachment":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/media?parent=13104"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/categories?post=13104"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/tags?post=13104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}