{"id":3497,"date":"2015-01-09T12:00:09","date_gmt":"2015-01-09T17:00:09","guid":{"rendered":"http:\/\/www.unifiedinfotech.net\/?p=3497"},"modified":"2022-05-20T08:44:56","modified_gmt":"2022-05-20T12:44:56","slug":"taking-a-close-look-at-google-lollipop","status":"publish","type":"post","link":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/","title":{"rendered":"Taking a Close Look at Google Lollipop"},"content":{"rendered":"<p>Multi-tasking is nothing just a critical function that is associated with every mobile. Users always expect to perform frivolously and jump from one task to other. They often get frustrated if they have to wait for content to re-load when moving from one application to another.<\/p>\n<p><b>Keeping mind of the users demands Android introduced their latest version &#8211; LOLLIPOP<\/b><\/p>\n<p>Google Lollipop is the latest version of the Android mobile operating system developed by Google, unveiled on June 25, 2014 during Google I\/O. Instead of just dropping the user back into the app, it allows developers to break apart the tasks and make it appear as a cascade in distinct windows.<\/p>\n<p>Lollipop gives the devs more power to increase the productivity of the apps they design. The combination of this new <a href=\"https:\/\/developer.android.com\/guide\/topics\/ui\/look-and-feel\">Material Design<\/a> is aesthetically pleasing and allows the Android Apps to get the similar kind of polish and elegance, which you can typically find in an iOS app.<\/p>\n<p><b>Material Design – A Close Look<\/b><\/p>\n<p>Material design is the buzzing topic in the air and plenty of people have written about it. This new aesthetics from the house of Google for Android 5.0 ramps up the elegance, relying on more touch events, more animation, increased white space and allusions to real objects.<\/p>\n<p>It is the most radical design for the Android and shows major improvement in the look and functionality of Google’s mobile operating system. You might have taken dived in the important features of Google Lollipop, but the goal for this stress on the multitasking aspect.<\/p>\n<p>Let us look at the Material Design in terms of multitasking. The paradigm has shown a quick shift from moving from one app to another instead moving between the tasks. The recent apps now have renamed as Overview gives the users a survey of the work they are doing instead of the list of apps opened on their device.<\/p>\n<p><b>Activities Associated with Overview <\/b><\/p>\n<p>You will find that aesthetically the overview turns the app-switching screen into a series of cards. Look at this diagram below to get a good grasp of the thing:<\/p>\n<p>Similar to Google Search Google Now has also adopted transformation into cards. You are going to see the apps listed in this way frozen in their recent state. It goes a little deeper to break apart their activities into their own cards.<\/p>\n<p>It was just yesterday we took a dip in the chocolaty goodness of Android 4.4 KitKat, and now we got the new and tastier version Android 5.0 Lollipop. It has received new polished design, features and some catching up iOS makes it an essential download.<\/p>\n<p>Things you need to know about Android 5.0 Lollipop –<\/p>\n<ul>\n<li><b>EVERYTHING IS SO FRESH: <\/b><b>Look &amp; Feel &#8211;<\/b> Apps on Android’s new version Google&#8217;s Lollipop looks bolder, colorful, and has a responsive UI design for consistent, intuitive experiences across all your devices.<\/li>\n<li><b>Font &amp; Typography:<\/b> Remember your default Android font “Roboto” it too has received some favorable tweaks to make it curvier and wider. It is now looking clean and the white space as well as navigation buttons have a PlayStation controller-style with minimalist makeover.<\/li>\n<li><b>Shortcut Buttons:<\/b> The favorite addition is the new floating action button in each app Google choose what it think as the most suitable shortcut and sticks in it in a colorful circular icon making everything FAST.<\/li>\n<li><b>SMARTY NOTIFICATIONS: <\/b>Notification system grows out to be prettier as you get new and smart ways to control when and how you receive messages.<\/li>\n<\/ul>\n<ul>\n<li>1. Notifications now sit as white ‘cards’ just below the quick settings panel<\/li>\n<li>2. View and respond to messages directly from your lock screen. Now it includes the ability to hide sensitive content for these notifications.<\/li>\n<li>3. Notification now drops from the top of the screen so that you can carry on playing game or watch movie in relative peace. These notifications banner jumps straight into action open, delete, reply etc a feature that Google uses to catch up iOS8.<\/li>\n<li>4. Latest and a great feature named as the Lollipop’s new management of ‘interruptions’ where you can turn on the priority mode of your device so that only some people and notification can get through. This is a version of Do Not Disturb on iOS and Assist on the Moto X.<\/li>\n<li>5. It helps to control the notifications triggered by apps. Users can now hide sensitive contents and prioritize or turn off the app’s notification.<\/li>\n<\/ul>\n<p><b>PROJECT VOLTA<\/b><\/p>\n<p>All hail for the long power haul, as Google inputs many details around in their battery life. It increases efficiency optimizations and increases stamina as a part of Project Volta.<\/p>\n<ul>\n<li>1. This includes apps that conserve more battery. The battery saving feature extends device use by up to 90 minutes.<\/li>\n<li>2. You will find the estimated time to fully charge when you plug-in the device<\/li>\n<li>3. Even you can find estimated time left on your device before you need to charge again is now in your battery settings.<\/li>\n<\/ul>\n<p><b>SECURITY METER GETS SOME MORE BROWNIES!<\/b><\/p>\n<p>You will witness a number of behind the scene changes in Android 5.0 Lollipop version. Now it is a great stuff to keep you safe.<\/p>\n<ul>\n<li>1. As new devices come with encryption automatically turned on to, help protect data on lost or stolen devices.<\/li>\n<li>2. SELinux enforces on all apps to have even better protection against vulnerabilities and malware.<\/li>\n<li>3. Now you can use Android Smart Lock to secure your phone or tablet by pairing it with a trusted device like your wearable or your car.<\/li>\n<li>4. Android 5.0 adds a guest mode functionality that is simple to use. It makes sure that your app in constantly under monitoring and there is no malware lurking and doing damage.<\/li>\n<li>5. It adds user profiles for the first time on Smartphones, until the date it was only available on the tablets. You can now add or switch between multiple users and guest session clicking on the icon at top right of the notification pull-down.<\/li>\n<\/ul>\n<p><b>TWEAKS IN DEVICE SHARING<\/b><\/p>\n<p>Makes sharing more easy and flexible.<\/p>\n<ul>\n<li>a. Users can now enjoy the new goodies such as multiple users for phones. If you forget your phone, you still can call any of your friends or access any of your messages, photos and more, simply logging into another Android phone running Lollipop. This facility is perfect for the families who want to share a phone, but not their stuff.<\/li>\n<li>b. Google makes the setup and transfer of apps and wallpapers from other Androids easier than ever.<\/li>\n<li>c. The new feature also allows screen pinning, so that other users can access just a particular content without messing other stuffs of the user who pinned the content.<\/li>\n<\/ul>\n<p><b>BOOST IN PERFORMANCE AND RUNTIME<\/b><\/p>\n<p>It’s time to get excited as Google has made to the performance of Android 5.0 and they thanks ART wholeheartedly for this exclusive add-on.<\/p>\n<ul>\n<li>1. ART is the new default runtime; the engine running behind the scenes completely renewed, improves application performance and responsiveness.<\/li>\n<li>2. Apps and animations run at a much more fluid 60fps, and ART offers over twice the speed of its previous runtime indicating 4X performance improvements.<\/li>\n<li>3. It shows improvement in the graphics performance. Google worked with Nvidia and Qualcomm to improve optimizations within their own processors.<\/li>\n<li>4. Gives access to smoother User Interface for complex, visually rich applications<\/li>\n<li>5. Compact backgrounded apps and services allows you to access a lot more<\/li>\n<li>6. Lollipop also supports 64-bit processing, SoCs and native apps like Chrome, Gmail, Calendar, Google Play Music, and more<\/li>\n<li>7. Pure Java language apps run as 64-bit apps automatically<\/li>\n<\/ul>\n<p><b>BOLDER GOOGLE APPS<\/b><\/p>\n<ol>\n<li><b>MEDIA<\/b><\/li>\n<\/ol>\n<ul>\n<li>A. You can notice some bolder graphics, improved audio, video, and camera capabilities<\/li>\n<li>B. Lower latency audio input ensuring that music and communication apps provides an amazing real-time experience<\/li>\n<li>C. Multi-channel audio stream mixing allows professional audio applications to mix eight channels including 5.1 and 7.1 channels<\/li>\n<li>D. Android extension pack and OpenGL ES 3.1 brings Android to the front of mobile graphics on par with desktop and console<\/li>\n<li>E. As for camera, you get features such as full resolution frames around 30 fps, support raw formats like YUV and Bayer RAW, control capture settings for sensor, lens, and flash, capture metadata like noise models and optical information<\/li>\n<li>F. Use of the state-of-the-art technology in videos with support for HEVC to allow for UHD 4K video playback, tunneled video for high-quality video playback on Android TV and improved HLS support for streaming<\/li>\n<\/ul>\n<ol start=\"2\">\n<li><b>OK GOOGLE<\/b><\/li>\n<\/ol>\n<ul>\n<li>A. Even if the screen is off, you can say &#8220;OK Google&#8221; on devices with the help of digital signal processing<\/li>\n<li>B. You can talk to the Google on the way and send a text or get directions<\/li>\n<\/ul>\n<ol start=\"3\">\n<li><b>ANDROID TV<\/b><\/li>\n<\/ol>\n<ul>\n<li>A. You get a cool and attractive support for living room devices with adapted user interface<\/li>\n<li>B. Users now need to browse less, watch more with personalized recommendations for content such as movies, TV shows.<\/li>\n<li>C. Now you just need to say what you want to see with voice search for Google Play, YouTube<\/li>\n<li>D. They have enabled console-style Android gaming on TV with a gamepad<\/li>\n<li>E. Users can cast their favorite entertainment apps on big screen with Google Cast support for Android TV devices<\/li>\n<\/ul>\n<ol start=\"4\">\n<li><b>ACCESSIBILITY &amp; LANGUAGES<\/b><\/li>\n<\/ol>\n<ul>\n<li>A. Now the new Android version allows low vision and colorblind capabilities<\/li>\n<li>B. Helps to boost contrast or invert colors to improve legibility<\/li>\n<li>C. Users can adjust display to improve color differentiation<\/li>\n<li>The new version is available in 68+ languages with 15 new addition &#8211; Basque, Bengali, Burmese, Chinese (Hong Kong), Galician, Icelandic, Kannada, Kyrgyz, Macedonian, Malayalam, Marathi, Nepali, Sinhala, Tamil, Telugu<\/li>\n<li>D. The version allows your new Android phone or tablet instant set up by simply tapping it to your old one<\/li>\n<\/ul>\n<ol start=\"5\">\n<li><b>QUICK SETTINGS AND CONNECTIVITY<\/b><\/li>\n<\/ol>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>A. You would come across handy controls such as flashlight, hotspot, screen rotation and cast screen controls<\/li>\n<li>B. Now users can get to the most frequently used settings with just two swipes down from the top of the screen<\/li>\n<li>C. You would find it easier on\/off toggles for Wi-Fi, Bluetooth and location<\/li>\n<li>D. You can adjust the brightness manually, and it will kick it based on ambient lightning<\/li>\n<li>E. Now you can expect a better connection and more powerful Bluetooth low energy capabilities<\/li>\n<li>F. Now users can continue their video chat or VoIP calls without interruption, whether you leave the house and switch from Wi-Fi and then back to cellular<\/li>\n<li>G. Help to improve the selection logic so that the device connects only if there is a verified internet connection<\/li>\n<li>H. Allows power-efficient scanning for nearby Bluetooth low energy like wearables or beacons<\/li>\n<li>I. User also gets a new BLE peripheral mode<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><b>SOME MORE ANDROID VERDICTS<\/b><\/p>\n<ol start=\"6\">\n<li style=\"list-style-type: none;\"><\/li>\n<\/ol>\n<ul>\n<li>1. Now users can easily manage multiple payment apps by quickly switching between them<\/li>\n<li>2. You get access to print preview and page range support<\/li>\n<li>3. You will find a revamped display for battery, Bluetooth, data usage, and Wi-Fi settings and new search functionality<\/li>\n<li>4. Get access to Android Beam that let you share a file with someone nearby by gently tapping the two devices at a time<\/li>\n<li>5. If supported with hardware, your device will wake up and soon pick it up or you need to tap the screen twice<\/li>\n<li>6. The newest version also allows improved hardware keyboard accessory support including multilingual support, emoji input, search key, and improved app and system key<\/li>\n<\/ul>\n<p>Interested to develop an Android app? Take a look at our <a href=\"https:\/\/www.unifiedinfotech.net\/services\/android-app-development\/\" target=\"_blank\">Android App Development Services<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Multi-tasking is nothing just a critical function that is associated with every mobile. Users always expect to perform frivolously and jump from one task to other. They often get frustrated if they have to wait for content to re-load when moving from one application to another. Keeping mind of the users demands Android introduced their [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3509,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[14,27],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.6.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A Close Look into Google Lollipop | Unified Infotech<\/title>\n<meta name=\"description\" content=\"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Close Look into Google Lollipop | Unified Infotech\" \/>\n<meta property=\"og:description\" content=\"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\" \/>\n<meta property=\"og:site_name\" content=\"Unified Infotech\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/unifiedinfotech\/\" \/>\n<meta property=\"article:published_time\" content=\"2015-01-09T17:00:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-05-20T12:44:56+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2015\/01\/lolli-820x420-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"825\" \/>\n\t<meta property=\"og:image:height\" content=\"430\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Pratip Biswas\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@unified_infotec\" \/>\n<meta name=\"twitter:site\" content=\"@unified_infotec\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pratip Biswas\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\"},\"author\":{\"name\":\"Pratip Biswas\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428\"},\"headline\":\"Taking a Close Look at Google Lollipop\",\"datePublished\":\"2015-01-09T17:00:09+00:00\",\"dateModified\":\"2022-05-20T12:44:56+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\"},\"wordCount\":1879,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\"},\"articleSection\":[\"All\",\"Tech\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\",\"name\":\"A Close Look into Google Lollipop | Unified Infotech\",\"isPartOf\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#website\"},\"datePublished\":\"2015-01-09T17:00:09+00:00\",\"dateModified\":\"2022-05-20T12:44:56+00:00\",\"description\":\"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.unifiedinfotech.net\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Taking a Close Look at Google Lollipop\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#website\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/\",\"name\":\"Unified Infotech\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.unifiedinfotech.net\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#organization\",\"name\":\"Unified Infotech\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/\",\"sameAs\":[\"https:\/\/www.instagram.com\/unified.infotech\/\",\"https:\/\/www.linkedin.com\/company\/unifiedinfotech\/\",\"https:\/\/www.facebook.com\/unifiedinfotech\/\",\"https:\/\/twitter.com\/unified_infotec\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg\",\"contentUrl\":\"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg\",\"width\":300,\"height\":300,\"caption\":\"Unified Infotech\"},\"image\":{\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428\",\"name\":\"Pratip Biswas\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g\",\"caption\":\"Pratip Biswas\"},\"description\":\"I am an Entrepreneur and a Tech Geek with more than 1500 successful projects launched. I share my experience through my love for writing and help other entrepreneurs reach their business goals.\",\"sameAs\":[\"https:\/\/www.unifiedinfotech.net\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"A Close Look into Google Lollipop | Unified Infotech","description":"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/","og_locale":"en_US","og_type":"article","og_title":"A Close Look into Google Lollipop | Unified Infotech","og_description":"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.","og_url":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/","og_site_name":"Unified Infotech","article_publisher":"https:\/\/www.facebook.com\/unifiedinfotech\/","article_published_time":"2015-01-09T17:00:09+00:00","article_modified_time":"2022-05-20T12:44:56+00:00","og_image":[{"width":825,"height":430,"url":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2015\/01\/lolli-820x420-1.jpg","type":"image\/jpeg"}],"author":"Pratip Biswas","twitter_card":"summary_large_image","twitter_creator":"@unified_infotec","twitter_site":"@unified_infotec","twitter_misc":{"Written by":"Pratip Biswas","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#article","isPartOf":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/"},"author":{"name":"Pratip Biswas","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428"},"headline":"Taking a Close Look at Google Lollipop","datePublished":"2015-01-09T17:00:09+00:00","dateModified":"2022-05-20T12:44:56+00:00","mainEntityOfPage":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/"},"wordCount":1879,"commentCount":0,"publisher":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization"},"articleSection":["All","Tech"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/","url":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/","name":"A Close Look into Google Lollipop | Unified Infotech","isPartOf":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#website"},"datePublished":"2015-01-09T17:00:09+00:00","dateModified":"2022-05-20T12:44:56+00:00","description":"The latest version of Android Mobile OS, 5.0 popularly called Google Lollipop is here. Lets take a closer look or Read this article to learn more.","breadcrumb":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.unifiedinfotech.net\/blog\/taking-a-close-look-at-google-lollipop\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.unifiedinfotech.net\/blog\/"},{"@type":"ListItem","position":2,"name":"Taking a Close Look at Google Lollipop"}]},{"@type":"WebSite","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#website","url":"https:\/\/www.unifiedinfotech.net\/blog\/","name":"Unified Infotech","description":"","publisher":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.unifiedinfotech.net\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#organization","name":"Unified Infotech","url":"https:\/\/www.unifiedinfotech.net\/blog\/","sameAs":["https:\/\/www.instagram.com\/unified.infotech\/","https:\/\/www.linkedin.com\/company\/unifiedinfotech\/","https:\/\/www.facebook.com\/unifiedinfotech\/","https:\/\/twitter.com\/unified_infotec"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg","contentUrl":"https:\/\/www.unifiedinfotech.net\/blog\/wp-content\/uploads\/2019\/06\/LinkedIn-Company-Logo-Image-black.jpg","width":300,"height":300,"caption":"Unified Infotech"},"image":{"@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/6678f51be7224e0dee5a17bc2d8a5428","name":"Pratip Biswas","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.unifiedinfotech.net\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b8a39b993d92d9c5bcc87bd89223b371?s=96&d=mm&r=g","caption":"Pratip Biswas"},"description":"I am an Entrepreneur and a Tech Geek with more than 1500 successful projects launched. I share my experience through my love for writing and help other entrepreneurs reach their business goals.","sameAs":["https:\/\/www.unifiedinfotech.net\/"]}]}},"_links":{"self":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/3497"}],"collection":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/comments?post=3497"}],"version-history":[{"count":8,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/3497\/revisions"}],"predecessor-version":[{"id":13799,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/posts\/3497\/revisions\/13799"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/media\/3509"}],"wp:attachment":[{"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/media?parent=3497"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/categories?post=3497"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.unifiedinfotech.net\/blog\/wp-json\/wp\/v2\/tags?post=3497"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}